note esame/analisi sistemi dinamici/analisi-modale.tex
% Created 2022-06-25 Sat 11:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsfonts}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Ripassino Laplacino}
\label{sec:org144fa91}

\subsection{Definizione}
\label{sec:orgab5d198}
\[\mathcal{L}\{f(t)\} = \int_{0}^{\infty} f(t) e^{-st} dt \]
con \(s\) variabile complessa generica, di forma \(\sigma + j\omega\) con
\(\sigma\) e \(\omega\) \(\in\) \(\mathbb{R}\)

e si usa \(F(s)\) per indicare \(\mathcal{L}\{f(t)\}\), convenzione
ripresa dal caro vecchio \(F = \int f\).

\subsection{Cosi notevoli}
\label{sec:org840e84f}

I cosi notevoli si ricavano con due componenti
\begin{itemize}
\item Trasformata del gradino unitario
\item Abuso di varie proprietà del cazzo
\end{itemize}

Le trasformate che vogliamo ricavare sono le seguenti
\begin{itemize}
\item \textbf{Gradino} (tutto è causale, tutto viene dal gradino)
\item \textbf{Esponenziale} (è una trasformata, che t'aspetti?)
\item \textbf{Seni e coseni} (hai l'esponenziale, che t'aspetti?)
\item \textbf{Polinomii}
\item \textbf{Funzioni razionali}
\end{itemize}

L'esponenziale \& Co. sarà ricavato con i soliti teoremi da
esponenziale (mi spiace)

Per i polinomii \& Co.

\subsubsection{Gradino unitario}
\label{sec:org7ec61f8}

\[ \frac{1}{s} \]


e ora, a chi volesse un flashback dell'Argenti

\subsubsection{Linearità}
\label{sec:org073ea8b}

Grazialcazzo

\subsubsection{Traslazione in frequenza}
\label{sec:orgafa5ec2}

da questa si ricava

\subsubsection{Esponenziale}
\label{sec:orgd3c8f46}

abbiamo un esponenziale complesso, abbiamo la linearità, indovina un
po'? Abbiamo

\subsubsection{Seni e coseni}
\label{sec:org798e986}

\subsubsection{Derivazione in frequenza}
\label{sec:org8abef60}

Con questa si può iniziare a scazzare con polinomii, si ricavano
intanto i monomii in Laplace, poi linearità \(\to\) grazialcazzo

\subsubsection{Rampa unitaria}
\label{sec:org4edafa1}

\subsubsection{Rampa non unitaria}
\label{sec:orge56faf9}

\subsubsection{Derivazione nel tempo}
\label{sec:org64bce70}

\subsubsection{Integrazione}
\label{sec:orgdbced96}

E ora, al fine di massimizzare il flashback argentialno

\subsubsection{Convoluzione nel tempo}
\label{sec:org43d56d2}

\subsubsection{Impulso di Dirac}
\label{sec:org5150283}
\end{document}